Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.pl-se.tmx
Source language: pl
Languages: se

source: Oznakowanie CE, homologacja i inspekcja urządzeń dźwigowych, maszyn i innego sprzętu
se: Brand

source: Systematyczna praca na rzecz poprawy środowiska pracy
se: Systematiskt arbetsmiljöarbete

source: Być przygotowanym na najgorsze
se: Skyddsstövlar/skyddskängor med sågskydd.

source: Praca w pojedynkę
se: Ensamarbete

source: Pomieszczenia pracownicze
se: Personalutrymmen

source: Apteczka pierwszej pomocy
se: Första förband

source: Higiena i czas pracy
se: Arbetsmiljö och arbetstid

source: W razie choroby
se: Det kallas för dygnsvila.

source: Ministerstwo Spraw Zagranicznych
se: Utrikesdepartementet
